# Даны два неупорядоченных набора целых чисел (может быть, с повторениями).
# Выдать без повторений в порядке возрастания все те числа, которые встречаются
# в обоих наборах.
# Пользователь вводит 2 числа. n - кол-во элементов первого множества. m - кол-во
# элементов второго множества. Затем пользователь вводит сами элементы
# множеств.

n = int(input("Введите кол-во элементов 1-го множества: "))
list_1 = [int(input()) for i in range (n)]
m = int(input("Введите кол-во элементовт 2-го множества: "))
list_2 = [int(input()) for i in range (m)]
new_list = list()
print(list_1, list_2)
for item in list_1:
    if item in list_2:
        new_list.append(item)
print(sorted(new_list))