# В фермерском хозяйстве в Карелии выращивают чернику. Она растет на круглой
# грядке, причем кусты высажены только по окружности. Таким образом, у каждого
# куста есть ровно два соседних. Всего на грядке растет N кустов.
# Семинар 4 2
# Эти кусты обладают разной урожайностью, поэтому ко времени сбора на них
# выросло различное число ягод – на i-ом кусте выросло ai ягод.
# В этом фермерском хозяйстве внедрена система автоматического сбора черники.
# Эта система состоит из управляющего модуля и нескольких собирающих модулей.
# Собирающий модуль за один заход, находясь непосредственно перед некоторым
# кустом, собирает ягоды с этого куста и с двух соседних с ним.
# Напишите программу для нахождения максимального числа ягод, которое может
# собрать за один заход собирающий модуль, находясь перед некоторым кустом
# заданной во входном файле грядки.

n = int(input('Введите количествао кустов: '))
my_list = []
for i in range(n):
    (a) = int(input(f'Введите количество ягод на {i+1} кусте: '))
    my_list.append(a)
print(my_list)
max = 0
for i in range(len(my_list)-1):
    sum = my_list[i-1] + my_list[i] + my_list[i+1]
    sum = my_list[i-2] + my_list[i-1] + my_list[i]
    if sum > max: max = sum
print(max)