#Найдите сумму цифр трехзначного числа.

n = int(input())
if n > 99 and n < 999:
    sum = n // 100 + ((n // 10) % 10) + n % 10
    print(sum)
else:
    print("Введено не трехзначное число")