# Задача 16: Требуется вычислить, сколько раз встречается некоторое число X в массиве A[1..N]. 
# Пользователь в первой строке вводит натуральное число N – количество элементов в массиве. 
# В последующих  строках записаны N целых чисел Ai. Последняя строка содержит число X

n = int(input())
list_1 = list()
for i in range(n):
    a = int(input())
    list_1.append(a)
x = int(input())
count_x = 0
for i in range(n):
    if x == list_1[i]:
        count_x += 1
print(count_x)
